function getBotResponse(input) {
    //rock paper scissors
    if (input == "बायोगैस क्या है") {
        return "यह ऑक्सीजन की अनुपस्थिति में कार्बनिक पदार्थों जैसे गोबर, मुर्गी पालन आदि के जैविक अपघटन की प्रक्रिया है। इसे अवायवीय पाचन भी कहा जाता है।";
    } else if (input == "बायोगैस की संरचना क्या है") {
        return "मीथेन (CH4) 55-60%, कार्बन डाइऑक्साइड (CO2) 35-40%, अमोनिया हाइड्रोजन सल्फाइड (H2S) और नमी के तत्व।";
    } 

      // Simple responses
    if (input == "नमस्ते") {
        return "नमस्ते!";
    } else if (input == "अलविदा") {
        return "आपसे बाद में बात करता हूँ।!";
    } else {
        return "कुछ और पूछ कर देखें!";
    }
}